export default {
  header: {
    links: {
      flightHotel: "Рейсы и Отели",
      tour: "Тур",
      visa: "Виза",
      profile: "Профиль",
    },
    signup: "Зарегистрироваться",
    signin: "Войти",
  },
  heroTitle:
    "Начните свое приключение с Fly-Ashgabat, где начинается ваше идеальное путешествие.",

  searchForm: {
    tabs: {
      flights: "Рейсы",
      hotels: "Отели",
    },
    flightType: {
      oneWay: "В одну сторону",
      RoundTrip: "Туда и обратно",
    },
    routeFrom: {
      label: "Город отправления",
      placeholder: "Откуда",
    },
    routeTo: {
      label: "Город назначения",
      placeholder: "Куда",
    },
    datePicker: {
      placeholder: "Выберите дату",
      tuda: "Дата отправления",
      obratno: "Дата возвращения",
    },
    passengers: {
      label: "Пассажир",
      placeholder: "Пассажиры",
      value: "1 пассажир",
    },
    typeFlights: [
      {
        id: 1,
        title: "Все",
        value: "All",
      },
      {
        id: 2,
        title: "Эконом",
        value: "Эконом",
      },
      {
        id: 3,
        title: "Бизнес",
        value: "Бизнес",
      },
    ],
    passengersLists: [
      {
        id: "adults_count",
        title: "Взрослые",
        text: "Старше 12 лет на момент полета",
        value: 1,
      },
      {
        id: "childs_count",
        title: "Дети",
        text: "От 2 до 12 лет на момент полета",
        value: 0,
      },
      {
        id: "infant_count",
        title: "Младенцы",
        text: "До 2 лет (без места, на руках у взрослого)",
        value: 0,
      },
    ],
    directFlights: {
      placeholder: "Только прямые рейсы",
    },
    searchButton: {
      flightText: "Поиск рейсов",
      hotelText: "Поиск отелей",
    },
  },
  tour: {
    title: "Изучите туры",
    text: "Планируете отдых или возвращаетесь домой? Наши инструменты делают каждое путешествие легким.",
    btn: "Забронировать тур",
    days: "дней",

    details: {
      included: "Включено",
      notIncluded: "Не включено",
      bannerTitle: "Готовы к путешествию?",
      bannerText:
        "Мы готовы предоставить вам лучший сервис, поэтому, пожалуйста, свяжитесь с нами.",
      bannerBtn: "Свяжитесь с нами",
    },
  },
  visa: {
    visa: "Виза",
    title: "Откройте мир с вашей визой",
    text: "Куда бы вы ни направлялись, наши инструменты обеспечат плавное и беззаботное путешествие.",
    book: "Забронировать",

    details: {
      docs: "Необходимые документы",
      price: "Цена",
      days: "Дней",
    },
  },
  seeMore: "Смотреть все",
  viewMore: "Посмотреть больше",
  footer: {
    title: "Fly-Ashgabat",
    text: "Fly-Ashgabat — Ваш надежный партнер в путешествиях и незабываемых приключениях.",
    usefullLink: "Полезные ссылки",
    socialMedia: "Социальные сети",
    copyright: "© 2024 Fly-Ashgabat. Все права защищены",
  },
  goBack: "Вернуться назад",
  loadMore: "Загрузить еще",
  scrollTop: "Прокрутить наверх",
  banner: {
    title:
      "Авиабилеты, отели и эксклюзивные предложения — всего в одном клике! Свяжитесь с нами круглосуточно для B2B-предложений.",
  },

  login: "Войти",
  signIn: {
    title: "Вход",
    text: "Войдите, чтобы получить доступ к своей учетной записи Golobe",
    email: {
      label: "Электронная почта",
      placeholder: "Aman{@}gmail.com",
    },
    password: {
      label: "Пароль",
      placeholder: "**********",
    },
    forget: "Забыли пароль?",
    accountText: "Нет учетной записи?",
  },
  signUp: {
    title: "Регистрация",
    text: "Зарегистрируйтесь, чтобы получить доступ к своей учетной записи Golobe",
    name: {
      label: "Имя",
      placeholder: "Аман",
    },
    lastName: {
      label: "Фамилия",
      placeholder: "Аманов",
    },
    email: {
      label: "Электронная почта",
      placeholder: "Aman{@}gmail.com",
    },
    company: {
      label: "Название компании",
      placeholder: "DH HJ",
    },
    password: {
      label: "Пароль",
      placeholder: "**********",
    },
    confirmPass: {
      label: "Подтвердите пароль",
      placeholder: "**********",
    },
    createAccount: "Создать учетную запись",
    accountText: "Уже есть учетная запись?",
  },

  filter: {
    filter: "Фильтр",
    title: "Фильтровать по",
    total: "Всего рейсов",
    sort: {
      val_1: "Сначала дешевые",
      val_2: "Сначала быстрые",
      val_3: "По времени отправления"
    },
    stops: {
      title: "Остановки",
      val_1: "Без пересадок",
      val_2: "1 пересадка",
      val_3: "2 пересадки",
    },
    baggage: {
      title: "Багаж",
      val_1: "Включен багаж",
    },
    departTime: {
      title: "Время отправления",
      val_1: "Утро",
      val_2: "После обеда",
      val_3: "Вечер",
      text_1: "(05:00 - 11:59)",
      text_2: "(12:00 - 17:59)",
      text_3: "(18:00 - 23:59)",
    },
    arriveTime: {
      title: "Время прибытия",
    },
    airlines: {
      title: "Авиакомпании",
    },
    btn: "Сбросить",
    resetAll: "Сбросить все фильтры",
  },

  ticket: {
    hour: "ч. ",
    minute: "мин. ",
    bookNow: "Забронировать",
    details: "Подробности",
    nonstop: "Без пересадок",
    travelClass: "Класс путешествия",
    departure: "Вылет",
    return: "Возвращение",

    flightDuration: "Продолжительность полёта",
    baggage: "Багаж",
    cabinBag: "Ручная кладь",
    change: "Изменение",
    cancellation: "Отмена",
    notInclude: "Не включено",
    include: "Включено",
    waitingDuration: "Время ожидания",
    duration: "Продолжительность",
  },

  booking: {
    contact: {
      title: "Контактная информация",
      text: "Пожалуйста, предоставьте вашу контактную информацию",
      firstName: {
        label: "Имя",
        placeholder: "Введите ваше имя"
      },
      middleName: {
        label: "Отчество",
        placeholder: "Введите отчество (необязательно)"
      },
      lastName: {
        label: "Фамилия",
        placeholder: "Введите вашу фамилию"
      },
      gmail: {
        label: "Email",
        placeholder: "Aman{'@'}gmail.com",
      },
      number: {
        label: "Телефон",
        placeholder: "Номер телефона",
      },
      gender: {
        label: "Пол",
        val_1: "Мужчина",
        val_2: "Женщина",
      },
      country: {
        label: "Страна проживания",
        placeholder: "Выберите страну",
      },
      city: {
        label: "Город",
        placeholder: "кв. 101, 123, ул. Главная",
      },
      street: {
        label: "Улица",
        placeholder: "кв. 101, 123, ул. Главная",
      },
    },
    options: {
      title: "Варианты бронирования",
      HandLuggageOptions: "Варианты ручной клади",
      OutwardLuggageOptions: "Варианты багажа в одну сторону",
      ReturnLuggageOptions: "Варианты обратного багажа",
      LuggageOptions: "Варианты багажа",
      MealType: "Тип еды",
      select_placeholder: "Выберите вариант",
    },
    passenger: {
      title: "Пассажир",
      text: "Пожалуйста, укажите данные, как в вашем проездном документе.",
      personal: "Личные данные",
      documents: "Документы",
      firstName: {
        label: "Имя",
        placeholder: "Аман",
      },
      middleName: {
        label: "Отчество",
        placeholder: "Введите отчество (необязательно)"
      },
      lastname: {
        label: "Фамилия",
        placeholder: "Аманов",
      },
      birth: {
        label: "Дата рождения",
        placeholder: "02-10-2000",
      },
      gender: {
        label: "Пол",
        val_1: "Мужчина",
        val_2: "Женщина",
      },
      passportCountry: {
        label: "Страна паспорта",
        placeholder: "Выберите страну",
      },
      citizenship: {
        label: "Гражданство",
        placeholder: "Выберите страну",
      },
      passportSeries: {
        label: "Серия и номер паспорта",
        placeholder: "AE010101",
      },
      passportExpire: {
        label: "Срок действия паспорта",
        placeholder: "09-11-2029",
      },
    },
    payment: {
      title: "Выберите способ оплаты",
      val_1: "Оплатить с баланса",
      val_2: "Оплата после",
    },
    submit: "Отправить",
    success: "Бронирование успешно отправлено!",
    startFailed: "Не удалось начать бронирование",
    submitFailed: "Не удалось отправить форму. Пожалуйста, попробуйте еще раз.",
  },

  loading: "Загрузка",
  notFound: "Данные не найдены.",

  profile: {
    tabs: {
      tab_1: "Аккаунт",
      tab_2: "Рейсы",
      tab_3: "Проживание",
      tab_4: "Выйти",
    },

    accaunt: {
      firstName: {
        label: "Имя",
        placeholder: "Аман",
      },
      lastname: {
        label: "Фамилия",
        placeholder: "Аманов",
      },
      company: {
        label: "Название компании",
        placeholder: "Айна ХД",
      },
      eamil: {
        label: "Email",
        placeholder: "Aman{@}gmail.com",
      },
      password: {
        label: "Пароль",
        placeholder: "********",
      },
      edit: "Редактировать",
    },
  },

  404: {
    title: "404 Не найдено",
    subTitle: "Эта страница не существует",
    goHome: "На главную",
  },

  loadingBooking: "Загрузка... Пожалуйста, подождите.",
  BookingTicket: {
    title: "Бронирование успешно завершено!",
    title2: "Бронирование успешно размещено!",
    contact_admin: "Свяжитесь с администрацией для завершения бронирования",
    subTitle: "Номер бронирования:",
    goHome: "На главную",
    form: {
      title: "Билеты",
      text: "Копия ваших билетов была отправлена на указанный контактный email.",
      passenger: "Пассажир",
      download: "Скачать",
    },
    status: {
      unconfirmed: "Авиакомпания не дала четкого указания о статусе этого бронирования. Если бронирование прошло успешно, вы должны получить подтверждение по электронной почте в ближайшее время. Если есть сомнения, пожалуйста, свяжитесь с нашей службой поддержки. Пожалуйста, подождите и не пытайтесь повторно забронировать, пока не будет установлен окончательный статус.",
      unconfirmedBySupplier: "Авиакомпания не дала четкого указания о статусе этого бронирования. Если бронирование прошло успешно, вы должны получить подтверждение по электронной почте в ближайшее время. Если есть сомнения, пожалуйста, свяжитесь с нашей службой поддержки. Пожалуйста, подождите и не пытайтесь повторно забронировать, пока не будет установлен окончательный статус.",
      duplicate: "Наша система обнаружила, что у вас уже есть подтвержденное бронирование с теми же данными пассажира и рейса. Пожалуйста, проверьте детали вашего существующего бронирования.",
      failed: "Бронирование не удалось. Пожалуйста, подождите и не пытайтесь повторно забронировать, пока не будет установлен окончательный статус. Если проблема сохраняется, попробуйте снова или свяжитесь с нашей службой поддержки для получения помощи.",
      succeeded: "Бронирование успешно завершено!",
      pending: "Ваше бронирование обрабатывается. Пожалуйста, подождите...",
      bookingInProgress: "Ваше бронирование обрабатывается. Пожалуйста, подождите..."
    }
  },

  confirmModal: {
    title: "Подтвердите бронирование",
    message: "Финальная цена: {amount} {currency}. Вы хотите продолжить бронирование?",
    cancel: "Отмена",
    confirm: "Подтвердить"
  },

  timer: {
    resultTitle: "Ваша сессия поиска истекла. Пожалуйста, обновите результаты, чтобы увидеть актуальные рейсы.",
    bookingTitle: "Ваша сессия поиска истекла. Пожалуйста, начните новый поиск для бронирования билетов.",
    resultBtn: "Обновить результаты",
    bookingBtn: "Начать новый поиск"
  },
};
